# Даны 2 числа a и b. Получить их сумму, разность и произведение

a = 1
b = 1

sum = a + b
diff = a - b
prod_num = a * b

print(f"Сумма чисел {a} и {b} равна {sum}")
print(f"Разность чисел {a} и {b} равна {diff}")
print(f"Произведение чисел {a} и {b} равно {prod_num}")
